In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame()

In [4]:
print df

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]])

In [6]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [7]:
df1.head()

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [8]:
df1.head(2)

   0  1  2  3
0  1  2  3  4
1  5  6  7  8

In [9]:
df1.tail(2)

    0   1   2   3
3  13  14  15  16
4  17  18  19  20

In [10]:
df1.shape

(5, 4)

In [12]:
df1.iloc[0,1]

2

In [13]:
df1.iloc[0:2,0:3]

   0  1  2
0  1  2  3
1  5  6  7

In [14]:
df1

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20

In [15]:
df1 = pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16],[17,18,19,20]],columns=['A','B','C','D'])

In [16]:
df1

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16
4  17  18  19  20